In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.1.1

In [2]:
used_car = pd.read_csv('usedcars.csv')

In [3]:
used_car.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992   7413.0  Yellow         AUTO
1  2011   SEL  20995  10926.0    Gray         AUTO
2  2011   SEL  19995   7351.0  Silver         AUTO
3  2011   SEL  17809  11613.0    Gray         AUTO
4  2012    SE  17500   8367.0   White         AUTO

In [4]:
used_car.tail()

     year model  price  mileage   color transmission
145  2006   SES   6200      NaN  Silver         AUTO
146  2002    SE   5995      NaN     Red         AUTO
147  2000    SE   5980      NaN     Red         AUTO
148  2001    SE   4899      NaN  Yellow         AUTO
149  2000    SE   3800      NaN     Red         AUTO

In [5]:
used_car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          150 non-null    int64
 1   model         150 non-null    object
 2   price         150 non-null    int64
 3   mileage       129 non-null    float64
 4   color         150 non-null    object
 5   transmission  150 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 7.2+ KB

In [6]:
used_car.describe()

              year         price        mileage
count   150.000000    150.000000     129.000000
mean   2008.993333  14242.353333   37531.666667
std       3.288166   9773.811205   20122.776366
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   24920.000000
50%    2009.000000  13631.000000   35574.000000
75%    2010.000000  14989.750000   44518.000000
max    2030.000000  90000.000000  127327.000000

In [7]:
used_car.rename(columns={'mileage':'car_mileage',}, inplace=True)
used_car.describe()

              year         price    car_mileage
count   150.000000    150.000000     129.000000
mean   2008.993333  14242.353333   37531.666667
std       3.288166   9773.811205   20122.776366
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   24920.000000
50%    2009.000000  13631.000000   35574.000000
75%    2010.000000  14989.750000   44518.000000
max    2030.000000  90000.000000  127327.000000

In [16]:
print(used_car.loc[1])

year               2011
model               SEL
price             20995
car_mileage     10926.0
color              Gray
transmission       AUTO
Name: 1, dtype: object

In [17]:
print(used_car.loc[2])

year              2011
model              SEL
price            19995
car_mileage     7351.0
color           Silver
transmission      AUTO
Name: 2, dtype: object

In [19]:
print(used_car.loc[3])

year               2011
model               SEL
price             17809
car_mileage     11613.0
color              Gray
transmission       AUTO
Name: 3, dtype: object

In [20]:
print(used_car.iloc[1])

year               2011
model               SEL
price             20995
car_mileage     10926.0
color              Gray
transmission       AUTO
Name: 1, dtype: object

In [21]:
print(used_car.iloc[2])

year              2011
model              SEL
price            19995
car_mileage     7351.0
color           Silver
transmission      AUTO
Name: 2, dtype: object

In [22]:
print(used_car.iloc[3])

year               2011
model               SEL
price             17809
car_mileage     11613.0
color              Gray
transmission       AUTO
Name: 3, dtype: object

In [23]:
print(used_car.loc[:, ['year', 'model', 'color']])

     year model   color
0    2011   SEL  Yellow
1    2011   SEL    Gray
2    2011   SEL  Silver
3    2011   SEL    Gray
4    2012    SE   White
..    ...   ...     ...
145  2006   SES  Silver
146  2002    SE     Red
147  2000    SE     Red
148  2001    SE  Yellow
149  2000    SE     Red

[150 rows x 3 columns]

In [25]:
print(used_car.loc[5, ['year', 'price', 'model']])

year      2010
price    17495
model      SEL
Name: 5, dtype: object

In [26]:
print(used_car.iloc[:, 1:4:2])

    model  car_mileage
0     SEL       7413.0
1     SEL      10926.0
2     SEL       7351.0
3     SEL      11613.0
4      SE       8367.0
..    ...          ...
145   SES          NaN
146    SE          NaN
147    SE          NaN
148    SE          NaN
149    SE          NaN

[150 rows x 2 columns]